<a href="https://colab.research.google.com/github/ashish42/MachineLearningPython/blob/master/Customer_Segmentation.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

#**Customer Segmentation in Python**

In [0]:
import pandas as pd
import warnings
warnings.filterwarnings('ignore')
df = pd.read_excel("http://archive.ics.uci.edu/ml/machine-learning-databases/00352/Online%20Retail.xlsx")
df.head()
df1 = df

In [4]:
df.head()

  InvoiceNo StockCode  ... CustomerID         Country
0    536365    85123A  ...    17850.0  United Kingdom
1    536365     71053  ...    17850.0  United Kingdom
2    536365    84406B  ...    17850.0  United Kingdom
3    536365    84029G  ...    17850.0  United Kingdom
4    536365    84029E  ...    17850.0  United Kingdom

[5 rows x 8 columns]

## Data Exploration 

1.   Missing Values 
2.   Customer distribution acroos the countries 
3.   Quantity & Price should be > 0
4.   Invoice date less than today's date

In [4]:
df.Country.nunique()

38

In [5]:
df.Country.unique()

array(['United Kingdom', 'France', 'Australia', 'Netherlands', 'Germany',
       'Norway', 'EIRE', 'Switzerland', 'Spain', 'Poland', 'Portugal',
       'Italy', 'Belgium', 'Lithuania', 'Japan', 'Iceland',
       'Channel Islands', 'Denmark', 'Cyprus', 'Sweden', 'Austria',
       'Israel', 'Finland', 'Bahrain', 'Greece', 'Hong Kong', 'Singapore',
       'Lebanon', 'United Arab Emirates', 'Saudi Arabia',
       'Czech Republic', 'Canada', 'Unspecified', 'Brazil', 'USA',
       'European Community', 'Malta', 'RSA'], dtype=object)

In [14]:
(df[['Country','CustomerID']].drop_duplicates()).groupby(['Country'])['CustomerID'].aggregate('count').reset_index().sort_values('CustomerID', ascending=False)

                 Country  CustomerID
36        United Kingdom        3950
14               Germany          95
13                France          87
31                 Spain          31
3                Belgium          25
33           Switzerland          21
27              Portugal          19
19                 Italy          15
12               Finland          12
1                Austria          11
25                Norway          10
24           Netherlands           9
0              Australia           9
6        Channel Islands           9
9                Denmark           9
7                 Cyprus           8
32                Sweden           8
20                 Japan           8
26                Poland           6
34                   USA           4
5                 Canada           4
37           Unspecified           4
18                Israel           4
15                Greece           4
10                  EIRE           3
23                 Malta           2
35  United Arab Emirates           2
2                Bahrain           2
22             Lithuania           1
8         Czech Republic           1
21               Lebanon           1
28                   RSA           1
29          Saudi Arabia           1
30             Singapore           1
17               Iceland           1
4                 Brazil           1
11    European Community           1
16             Hong Kong           0

More than 90% of the customers in the data are from the United Kingdom, so we will restrict our analysis to the UK only.

In [0]:
df1 = df1.loc[df1['Country'] == 'United Kingdom']

In [6]:
df1.isnull().sum(axis = 0)

InvoiceNo           0
StockCode           0
Description      1454
Quantity            0
InvoiceDate         0
UnitPrice           0
CustomerID     133600
Country             0
dtype: int64

There are 133,600 missing values in the CustomerID column, and since our analysis is based on customers, we will remove these missing values.

In [0]:
df1 = df1[pd.notnull(df1['CustomerID'])]

In [8]:
df1['Quantity'].min()

-80995

In [9]:
df1 = df1[(df1['Quantity']>0)]
df1.shape
df1.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 354345 entries, 0 to 541893
Data columns (total 8 columns):
InvoiceNo      354345 non-null object
StockCode      354345 non-null object
Description    354345 non-null object
Quantity       354345 non-null int64
InvoiceDate    354345 non-null datetime64[ns]
UnitPrice      354345 non-null float64
CustomerID     354345 non-null float64
Country        354345 non-null object
dtypes: datetime64[ns](1), float64(2), int64(1), object(4)
memory usage: 24.3+ MB

In [10]:
def unique_counts(df1):
   for i in df1.columns:
       count = df1[i].nunique()
       print(i, ": ", count)
unique_counts(df1)

InvoiceNo :  16649
StockCode :  3645
Description :  3844
Quantity :  294
InvoiceDate :  15615
UnitPrice :  403
CustomerID :  3921
Country :  1

In [0]:
#add column for total price 
df1['TotalPrice'] = df1['Quantity'] * df1['UnitPrice']

In [12]:
df1['InvoiceDate'].min()
df1['InvoiceDate'].max()

Timestamp('2011-12-09 12:49:00')

In [28]:
df1['InvoiceDate'].max()

Timestamp('2011-12-09 12:49:00')

Since last date is 2011-12-09 , we will consider 2011-12-10 to calculate the recency

In [0]:
import datetime as dt
NOW = dt.datetime(2011,12,10)
df1['InvoiceDate'] = pd.to_datetime(df1['InvoiceDate'])

##**RFM Customer Segmentation**

###Create RFM Table

In [0]:
rfmTable = df1.groupby('CustomerID').agg({'InvoiceDate': lambda x: (NOW - x.max()).days, 'InvoiceNo': lambda x: len(x), 'TotalPrice': lambda x: x.sum()})
rfmTable['InvoiceDate'] = rfmTable['InvoiceDate'].astype(int)
rfmTable.rename(columns={'InvoiceDate': 'recency', 
                         'InvoiceNo': 'frequency', 
                         'TotalPrice': 'monetary_value'}, inplace=True)

###Calculate RFM metrics for each customer

In [15]:
rfmTable.head()

            recency  frequency  monetary_value
CustomerID
12346.0         325          1        77183.60
12747.0           2        103         4196.01
12748.0           0       4596        33719.73
12749.0           3        199         4090.88
12820.0           3         59          942.34

### Split the metrics
The easiest way to split metrics into segments is by using quartiles.
1. This gives us a starting point for the detailed analysis.
2.  segments are easy to understand and explain.

In [0]:
quantiles = rfmTable.quantile(q=[0.25,0.5,0.75])
quantiles = quantiles.to_dict()

In [21]:
quantiles

{'frequency': {0.25: 17.0, 0.5: 41.0, 0.75: 99.0},
 'monetary_value': {0.25: 300.03999999999996,
  0.5: 651.8199999999999,
  0.75: 1575.89},
 'recency': {0.25: 17.0, 0.5: 50.0, 0.75: 142.0}}

###Create a segmented RFM table

In [0]:
segmented_rfm = rfmTable

The lowest recency, highest frequency and monetary amounts are our best customers.

In [0]:
def RScore(x,p,d):
    if x <= d[p][0.25]:
        return 1
    elif x <= d[p][0.50]:
        return 2
    elif x <= d[p][0.75]: 
        return 3
    else:
        return 4
    
def FMScore(x,p,d):
    if x <= d[p][0.25]:
        return 4
    elif x <= d[p][0.50]:
        return 3
    elif x <= d[p][0.75]: 
        return 2
    else:
        return 1

In [0]:
segmented_rfm['r_quartile'] = segmented_rfm['recency'].apply(RScore, args=('recency',quantiles,))
segmented_rfm['f_quartile'] = segmented_rfm['frequency'].apply(FMScore, args=('frequency',quantiles,))
segmented_rfm['m_quartile'] = segmented_rfm['monetary_value'].apply(FMScore, args=('monetary_value',quantiles,))

In [26]:
segmented_rfm.head()

            recency  frequency  ...  f_quartile  m_quartile
CustomerID                      ...
12346.0         325          1  ...           4           1
12747.0           2        103  ...           1           1
12748.0           0       4596  ...           1           1
12749.0           3        199  ...           1           1
12820.0           3         59  ...           2           2

[5 rows x 6 columns]

### Add a new column to combine RFM score: 111 is the highest score

In [28]:
segmented_rfm['RFMScore'] = segmented_rfm.r_quartile.map(str) + segmented_rfm.f_quartile.map(str) + segmented_rfm.m_quartile.map(str)
segmented_rfm.head()

            recency  frequency  monetary_value  ...  f_quartile  m_quartile  RFMScore
CustomerID                                      ...
12346.0         325          1        77183.60  ...           4           1       441
12747.0           2        103         4196.01  ...           1           1       111
12748.0           0       4596        33719.73  ...           1           1       111
12749.0           3        199         4090.88  ...           1           1       111
12820.0           3         59          942.34  ...           2           2       122

[5 rows x 7 columns]

##**Top 10 Customer**

In [29]:
segmented_rfm[segmented_rfm['RFMScore']=='111'].sort_values('monetary_value', ascending=False).head(10)

            recency  frequency  monetary_value  ...  f_quartile  m_quartile  RFMScore
CustomerID                                      ...
18102.0           0        431       259657.30  ...           1           1       111
17450.0           8        337       194550.79  ...           1           1       111
17511.0           2        963        91062.38  ...           1           1       111
16684.0           4        277        66653.56  ...           1           1       111
14096.0           4       5111        65164.79  ...           1           1       111
13694.0           3        568        65039.62  ...           1           1       111
15311.0           0       2379        60767.90  ...           1           1       111
13089.0           2       1818        58825.83  ...           1           1       111
15769.0           7        130        56252.72  ...           1           1       111
15061.0           3        403        54534.14  ...           1           1       111

[10 rows x 7 columns]